Tekla Open API Reference for Tekla Structures 2025
IPreferredPlacing Interface
 The IPreferredPlacing interface is for objects that can have different preferred placing types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IPreferredPlacing
Public Interface IPreferredPlacing
The IPreferredPlacing type exposes the following members.
Properties
Name | Description
PreferredPlacing
 The type of placing the object should use. See PreferredPlacingTypes for different types of placing.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace